'============ Umar ==========='


# 1 задание 

# num1 = 10.5
# print(num1)
# print(int(num1))
# print(str(num1))

'----------------------------------------------------------------'

# 2 задание 

# num2 = float(input('введите число: ')) 

# print('Остаток от деления на 5:',num1 % 5)
# print('Возведение числа в степень на 3:', num1 ** 3)
# print('Округление числа до целого числа:', round(num1))

'----------------------------------------------------------------'

# 3 задание 

# num3 = float(input('Введите свое число: '))

# print('Округление числа до 1го знака:', round(num3, 1))
# print('Округление числа до 2го знака:', round(num3, 2)) 

'----------------------------------------------------------------'

# 4 задание 

# from decimal import Decimal
# num4 = input('Введите дробное число: ')
# num5 = (Decimal(num4))

# print(num5 + num5 + num5 + num5 + num5 + num5 + num5 + num5 + num5 + num5)
# print(type(num5))
