# '===== Umar ======'


# '= 1 задание ='

# a = int(input('Введите первое число  '))
# b = int(input('Введите второе число  '))

# print("Сумма чисел: ", a + b)


# # #---------------------------------------------


# '= 2 задание ='

# employees = int(input('Введите количество сотрудников: '))
# salary = int(input('Введите зарплату одного сотрудника: '))

# print('Всего нужно выдать сотрудникам: ', employees*salary) 


# # #-------------------------------------------------------------


# '= 3 задание ='

# name = input("Введите свое имя: ")
# favorite_number = int(input('Укажите свое любимое число: '))

# print('Здравствуйте ', name,'! ', 'Ваше любимое число: ', favorite_number )
